#### One of the amazing things that you can use it in Jupyter notebook is Magic "Commands"
  That can be used to make the use of SQL inside Jupyter notebook easier which makes you more producible.
  
  Magic commands divided into two types:
  
    1. Cell magics: start with a double %% (percent) sign and apply to the "entire cell".
    2. Line magics: start with a single % (percent) sign and apply to a "particular line" in a cell.

#### To use the magic commands with SQL in jupyter notebook you should take a look at ipython-sql which you can install it using:
    !pip install ipython-sql

#### After installing it you need first to load the SQL extension and establish a connection with the database:
    %load_ext sql

#### Let us connect to a sqlite3 database
    import sqlite3
    
    # Creating and connecting to dev.db using sqlite2 module
    con = sqlite3.connect("dev.db")
    cur = con.cursor()
    # Here I will use the line magic to connect to the dev.db
    # each command must start with %sql
    %sql sqlite:///dev.db
    
#### You must see this output:
    'Connected: @dev.db'

#### I will read a csv file as dataframe then I will insert it as a table to the dev.db:

    # read the csv data
    import pandas as pd
    simple_table = pd.read_csv("name_of_csv_file.csv")
    # Now we can use the PERSIST command to insert the simple_table into the dev.db
    %sql PERSIST simple_table

#### Finally, you can be querying on your DB:
   %sql SELECT * FROM simple_table;

   %sql SELECT COUNT(*) FROM simple_table;

In [1]:
# !pip install ipython-sql
# !pip install pandas

In [2]:
%load_ext sql

In [3]:
# Requierments
import sqlite3
import pandas as pd

In [4]:
# Creating and connecting to dev.db using sqlite2 module
con = sqlite3.connect("dev.db")
cur = con.cursor()

In [5]:
# Here I will use the line magic to connect to the dev.db
# each command must start with %sql
%sql sqlite:///dev.db

'Connected: @dev.db'

In [6]:
# Read the csv file
simple_table = pd.read_csv("Employees.csv")

In [7]:
simple_table.columns = ['emp_id', 'fname', 'lname', 'removed', 'birth_date', 'gender', 'address', 'salary', 'dept_id', 'removed', 'removed']

In [8]:
simple_table = simple_table.drop('removed', axis=1)

In [9]:
simple_table.head(3)

,emp_id,fname,lname,birth_date,gender,address,salary,dept_id
0,E1002,Alice,James,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000
1,E1003,Steve,Wells,08/10/1980,M,"291 Springs, Gary,IL",300,50000
2,E1004,Santosh,Kumar,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000

In [10]:
simple_table.birth_date = pd.to_datetime(simple_table.birth_date)

In [11]:
# Insert the above table to the dev.db database using PERSIST command
%sql PERSIST simple_table

 * sqlite:///dev.db

'Persisted simple_table'

#### Show all the rows and columns:

In [12]:
%sql SELECT * FROM simple_table;

 * sqlite:///dev.db
Done.

[(0, 'E1002', 'Alice', 'James', '1972-07-31 00:00:00.000000', 'F', '980 Berry ln, Elgin,IL', 200, 80000),
 (1, 'E1003', 'Steve', 'Wells', '1980-08-10 00:00:00.000000', 'M', '291 Springs, Gary,IL', 300, 50000),
 (2, 'E1004', 'Santosh', 'Kumar', '1985-07-20 00:00:00.000000', 'M', '511 Aurora Av, Aurora,IL', 400, 60000),
 (3, 'E1005', 'Ahmed', 'Hussain', '1981-01-04 00:00:00.000000', 'M', '216 Oak Tree, Geneva,IL', 500, 70000),
 (4, 'E1006', 'Nancy', 'Allen', '1978-02-06 00:00:00.000000', 'F', '111 Green Pl, Elgin,IL', 600, 90000),
 (5, 'E1007', 'Mary', 'Thomas', '1975-05-05 00:00:00.000000', 'F', '100 Rose Pl, Gary,IL', 650, 65000),
 (6, 'E1008', 'Bharath', 'Gupta', '1985-05-06 00:00:00.000000', 'M', '145 Berry Ln, Naperville,IL', 660, 65000),
 (7, 'E1009', 'Andrea', 'Jones', '1990-07-09 00:00:00.000000', 'F', '120 Fall Creek, Gary,IL', 234, 70000),
 (8, 'E1010', 'Ann', 'Jacob', '1982-03-30 00:00:00.000000', 'F', '111 Britany Springs,Elgin,IL', 220, 70000)]

####  What is the number of rows in simple_table?

In [13]:
%sql SELECT COUNT(*) AS num_rows FROM simple_table;

 * sqlite:///dev.db
Done.

[(9,)]

####  What is the average of rows in simple_table?

In [14]:
%sql SELECT AVG(salary) FROM simple_table;

 * sqlite:///dev.db
Done.

[(418.22222222222223,)]

#### What is/are the names of the employees who get the highest salary?

In [15]:
%sql SELECT (fname || lname) AS Name, salary FROM simple_table WHERE salary = (SELECT MAX(salary) FROM simple_table);

 * sqlite:///dev.db
Done.

[('BharathGupta', 660)]

#### What is the year of birth of employees?

In [16]:
%sql SELECT strftime('%Y', birth_date) FROM simple_table;

 * sqlite:///dev.db
Done.

[('1972',),
 ('1980',),
 ('1985',),
 ('1981',),
 ('1978',),
 ('1975',),
 ('1985',),
 ('1990',),
 ('1982',)]

# Hope you learned somthing,